БИТУправление_медицинским_центром_демо/src/Documents/ЗаявкаНаТехОбслуживание/ЗаявкаНаТехОбслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаТехОбслуживание</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаПриемки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеФорматированное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принимающий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>CatalogRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияИзменений</name>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принимающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/ЗаявкаНаТехОбслуживание/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция ПолучитьСтатусЗаявки.
//
// Параметры:
//  ПлановаяДата	 - Дата	 - Плановая дата выполнения
//  ФактическаяДата	 - Дата	 - Фактическая дата выполнения
//  ДатаПриемки		 - Дата	 - Дата приемки заявки.
// 
// Возвращаемое значение:
//  Строка - формулировка статуса заявки.
//
Функция ПолучитьСтатусЗаявки(ПлановаяДата, ФактическаяДата, ДатаПриемки) Экспорт 
	
	Если ЗначениеЗаполнено(ДатаПриемки) Тогда 
		Возврат НСтр("ru='Принята'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФактическаяДата) Тогда 
		Возврат НСтр("ru='На проверке'");
	КонецЕсли;

	Если ЗначениеЗаполнено(ПлановаяДата) Тогда 
		Возврат НСтр("ru='Выполняется'");
	КонецЕсли;

	Возврат НСтр("ru='Зарегистрирована'");
	
КонецФункции

#КонецОбласти
